leihen0525/Master.Drivers.S32K1xx/Drivers.S32K1xx.I2C/Drivers.S32K1xx.I2C.c
/*
 * Drivers.S32K1xx.I2C.c
 *
 *  Created on: 2020年7月19日
 *      Author: Master.HE
 */
#include "Error.h"
#include "Define.h"

#include "Device\__Sys.Device.h"

#include "Module\Module.h"

#include "__Sys.API.h"

#include "S32K1xx.h"

#include "Drivers.S32K1xx.I2C.Struct.h"
#include "__Drivers.S32K1xx.I2C.Struct.h"

#include "Drivers.S32K1xx.I2C.Enum.h"
#include "Drivers.S32K1xx.I2C.h"

#include "Drivers.S32K1xx.LPI2C.h"

#include "Library/Library.FIFO.h"

Drivers_S32K1xx_I2C_DATA_Type Drivers_S32K1xx_I2C_DATA;

const __Sys_Device_OPS_Type __Device_OPS_I2C0=
{
	.Device_Name="I2C0",
	.Device_Args=LPI2C0,
	.Open=Drivers_S32K1xx_I2C_Open,
	.Close=Drivers_S32K1xx_I2C_Close,
	.Read=Null,
	.Write=Null,
	.Control=Drivers_S32K1xx_I2C_Control,

	.Info="MCU:S32K1xx Module:I2C0 Version:0.0.1 "__DATE__" "__TIME__,
};

#if (defined (__Target_S32K148__))
const __Sys_Device_OPS_Type __Device_OPS_I2C1=
{
	.Device_Name="I2C1",
	.Device_Args=LPI2C1,
	.Open=Drivers_S32K1xx_I2C_Open,
	.Close=Drivers_S32K1xx_I2C_Close,
	.Read=Null,
	.Write=Null,
	.Control=Drivers_S32K1xx_I2C_Control,

	.Info="MCU:S32K1xx Module:I2C1 Version:0.0.1 "__DATE__" "__TIME__,
};
#endif

int Drivers_S32K1xx_I2C_Setup(void)
{
	int Err;

	for(int i=0;i<LPI2C_INSTANCE_COUNT;i++)
	{
		Drivers_S32K1xx_I2C_DATA.I2C[i].Error=Drivers_S32K1xx_I2C_Error_OK;

		Drivers_S32K1xx_I2C_DATA.I2C[i].Open=false;

		Error_Args_Return(Drivers_S32K1xx_I2C_DATA.I2C[i].Semaphore,__Sys_Semaphore_Create(Null,1,1,Event_Queue_Option_FIFO));

		//初始化FIFO队列
		Error_NoArgs_Return(Err,Library_FIFO_2Byte_FIFO_Init(&Drivers_S32K1xx_I2C_DATA.I2C[i].TX_FIFO));
		Error_NoArgs_Return(Err,Library_FIFO_1Byte_FIFO_Init(&Drivers_S32K1xx_I2C_DATA.I2C[i].RX_FIFO));

		Drivers_S32K1xx_I2C_DATA.I2C[i].Tx_FIFO_Size=0;
		Drivers_S32K1xx_I2C_DATA.I2C[i].Rx_FIFO_Size=0;

		Error_Args_Return(Drivers_S32K1xx_I2C_DATA.I2C[i].Event_Flag,__Sys_Event_Flag_Create(Null,false));

	}

	//初始化中断函数和开启中断
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
	Error_Args_Return(Err,__Sys_IRQ_Register_Hook(LPI2C0_Master_Slave_IRQn,Drivers_S32K1xx_I2C_Master_Slave_IRQ,__Device_OPS_I2C0.Device_Args));
	Error_NoArgs_Return(Err,__Sys_IRQ_Enable(LPI2C0_Master_Slave_IRQn));
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	Error_Args_Return(Err,__Sys_IRQ_Register_Hook(LPI2C0_Master_IRQn,Drivers_S32K1xx_I2C_Master_IRQ,__Device_OPS_I2C0.Device_Args));
	Error_NoArgs_Return(Err,__Sys_IRQ_Enable(LPI2C0_Master_IRQn));

	Error_Args_Return(Err,__Sys_IRQ_Register_Hook(LPI2C0_Slave_IRQn,Drivers_S32K1xx_I2C_Slave_IRQ,__Device_OPS_I2C0.Device_Args));
	Error_NoArgs_Return(Err,__Sys_IRQ_Enable(LPI2C0_Slave_IRQn));
#endif
	//注册当前设备的OPS
	Error_NoArgs_Return(Err,__Sys_Device_Register_Drivers(&__Device_OPS_I2C0));

#if (defined (__Target_S32K148__))
	Error_Args_Return(Err,__Sys_IRQ_Register_Hook(LPI2C1_Master_IRQn,Drivers_S32K1xx_I2C_Master_IRQ,__Device_OPS_I2C1.Device_Args));
	Error_NoArgs_Return(Err,__Sys_IRQ_Enable(LPI2C1_Master_IRQn));

	Error_Args_Return(Err,__Sys_IRQ_Register_Hook(LPI2C1_Slave_IRQn,Drivers_S32K1xx_I2C_Slave_IRQ,__Device_OPS_I2C1.Device_Args));
	Error_NoArgs_Return(Err,__Sys_IRQ_Enable(LPI2C1_Slave_IRQn));

	Error_NoArgs_Return(Err,__Sys_Device_Register_Drivers(&__Device_OPS_I2C1));
#endif

	//获取MCU时钟树
	Error_NoArgs_Return(Err,__Sys_BSP_UpData_Clock_Tree((void **)&Drivers_S32K1xx_I2C_DATA.Clock.Source,(void **)&Drivers_S32K1xx_I2C_DATA.Clock.Tree));
	return Error_OK;
}
int Drivers_S32K1xx_I2C_Open(void *Device_Args,int Mode)
{
	if(Device_Args==Null)
	{
		return Error_Unknown;
	}
	int Frequency=0;
	int Err;
	int Index=Drivers_S32K1xx_I2C_GET_Count(Device_Args);

	//设备是独占的 不允许 多次打开
	if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Open==true)
	{
		return Error_Exist;
	}

	//Mode 作为时钟源参数
	//改变模块时钟之前确保时钟是关闭的
	Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_SET_Clock_Enabled((LPI2C_Type *)Device_Args,Disable));

	//设置模块时钟源
	Error_Args_Return(Frequency,Drivers_S32K1xx_LPI2C_SET_Clock_Source((LPI2C_Type *)Device_Args,(Drivers_S32K1xx_LPI2C_Clock_Source_Type)(Drivers_S32K1xx_I2C_Open_Mode_Clock_Source_Mask&Mode),Drivers_S32K1xx_I2C_DATA.Clock.Tree));

	//TODO 暂时只支持48M频率
	if(Frequency!=48000000)
	{
		return Error_Invalid_Parameter;
	}

	//打开模块时钟
	Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_SET_Clock_Enabled((LPI2C_Type *)Device_Args,Enable));



	//绑定事件组到当前任务的TCB中
	//Error_NoArgs_Return(Err,__Sys_Event_Flag_Group_Open(Drivers_S32K1xx_I2C_DATA.I2C[Index].Interrupt_Flag_Event_Flag_Group));

	Drivers_S32K1xx_I2C_DATA.I2C[Index].Open=true;
	return Error_OK;
}
int Drivers_S32K1xx_I2C_Close(void *Device_Args)
{
	if(Device_Args==Null)
	{
		return Error_Unknown;
	}
	int Err;
	int Index=Drivers_S32K1xx_I2C_GET_Count(Device_Args);

	//复位当前设备寄存器
	Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_Software_Reset((LPI2C_Type *)Device_Args));

	//关闭模块时钟
	Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_SET_Clock_Enabled((LPI2C_Type *)Device_Args,Disable));

	//清除当前任务的TCB中绑定的事件组
	//Error_NoArgs_Return(Err,__Sys_Event_Flag_Group_Close(Drivers_S32K1xx_I2C_DATA.I2C[Index].Interrupt_Flag_Event_Flag_Group));

	Drivers_S32K1xx_I2C_DATA.I2C[Index].Open=false;
	return Error_OK;
}
int Drivers_S32K1xx_I2C_Control(void *Device_Args,int Cmd, unsigned long Args)
{
	if(Device_Args==Null)
	{
		return Error_Unknown;
	}
	int Index=Drivers_S32K1xx_I2C_GET_Count(Device_Args);
	int Err;

	switch (Cmd&Drivers_S32K1xx_I2C_Cmd_Mask)
	{
		case Drivers_S32K1xx_I2C_Cmd_Master_Init:
		{
			Drivers_S32K1xx_I2C_Master_Init_Type *P_Init=(Drivers_S32K1xx_I2C_Master_Init_Type *)&Args;
			if(P_Init==Null)return Error_Invalid_Parameter;

			//复位模块寄存器
			Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_Software_Reset((LPI2C_Type *)Device_Args));

			//复位FIFO
			Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_Reset_FIFO((LPI2C_Type *)Device_Args,true,true));


