leihen0525/Master.Drivers.S32K1xx/Drivers.S32K1xx.I2C/Drivers.S32K1xx.I2C.c
			//设置PIN功能
			Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_PIN_Config((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_PIN_Config_2PinOpenDrain));

			//开启设备功能
			Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Function_Enabled((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_Function_Debug,Enable));

			//开启设备中断
			//Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Interrupt_Enabled((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_Interrupt_Frame_Complete,Enable));

			//48M Clock Frequency
			switch (P_Init->Baud_Rate)
			{
				case Drivers_S32K1xx_I2C_Baud_Rate_400Kbps:
				{
					//PRESCALE=0x00
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Prescaler((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_Prescaler_Divide_By_1));

					//FILTSCL=0x01 FILTSDA=0x01
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Glitch_Filter((LPI2C_Type *)Device_Args,0x01,0x01));

					//DATAVD=0x0F SETHOLD=0x1D CLKHI=0x35 CLKLO=0x3E
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Clock_Configuration_0((LPI2C_Type *)Device_Args,0x0F,0x1D,0x35,0x3E));
				}break;
				case Drivers_S32K1xx_I2C_Baud_Rate_1000Kbps:
				{
					//PRESCALE=0x02
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Prescaler((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_Prescaler_Divide_By_4));

					//FILTSCL=0x01 FILTSDA=0x01
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Glitch_Filter((LPI2C_Type *)Device_Args,0x01,0x01));

					//DATAVD=0x04 SETHOLD=0x03 CLKHI=0x04 CLKLO=0x06
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Clock_Configuration_0((LPI2C_Type *)Device_Args,0x04,0x03,0x04,0x06));
				}break;
				case Drivers_S32K1xx_I2C_Baud_Rate_3200Kbps:
				{
					//PRESCALE=0x00
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Prescaler((LPI2C_Type *)Device_Args,Drivers_S32K1xx_LPI2C_Master_Prescaler_Divide_By_1));

					//FILTSCL=0x00 FILTSDA=0x00
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Glitch_Filter((LPI2C_Type *)Device_Args,0x00,0x00));

					//DATAVD=0x01 SETHOLD=0x07 CLKHI=0x03 CLKLO=0x08
					Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Clock_Configuration_0((LPI2C_Type *)Device_Args,0x01,0x07,0x03,0x08));
				}break;

				default:
				{
					return Error_Invalid_Parameter;
				}break;
			}

			//打开模块
			Error_NoArgs_Return(Err,Drivers_S32K1xx_LPI2C_Master_SET_Module_Enabled((LPI2C_Type *)Device_Args,Enable));
			return Error_OK;

		}break;

		case Drivers_S32K1xx_I2C_Cmd_Master_Transmit_Cmd:
		{
			Err=Error_OK;
			int Temp_Err;

			Drivers_S32K1xx_I2C_Master_Transmit_Cmd_Type *P_Transmit_Cmd=(Drivers_S32K1xx_I2C_Master_Transmit_Cmd_Type *)Args;
			if(P_Transmit_Cmd==Null)return Error_Invalid_Parameter;

			//参数检查
			if((P_Transmit_Cmd->DATA==Null && P_Transmit_Cmd->Size!=0)
			|| (P_Transmit_Cmd->RepeatedDATA==Null && P_Transmit_Cmd->RepeatedSize!=0)
			|| (P_Transmit_Cmd->Slave_Address_10Bit==false && (P_Transmit_Cmd->DATA==Null || P_Transmit_Cmd->Size==0))
			|| (P_Transmit_Cmd->RepeatedSTART==true && (P_Transmit_Cmd->RepeatedDATA==Null || P_Transmit_Cmd->RepeatedSize==0))
			|| (P_Transmit_Cmd->Slave_Address_10Bit==true && P_Transmit_Cmd->Read==true))//这个地方？规范是这么写的 我还没有研究
			{
				return Error_Invalid_Parameter;
			}

			Error_NoArgs_Return(Err,__Sys_Semaphore_Wait(Drivers_S32K1xx_I2C_DATA.I2C[Index].Semaphore,P_Transmit_Cmd->TimeOut));

			//Check Busy
			Error_Args(Err,Drivers_S32K1xx_LPI2C_Master_GET_Interrupt_Flag((LPI2C_Type *)Device_Args))
			{
				goto Exit_I2C_Transmit_Cmd;
			}
			//检查总线忙 或者 I2C模块忙
			if((Err&Drivers_S32K1xx_LPI2C_Master_Interrupt_Bus_Busy)!=0 || (Err&Drivers_S32K1xx_LPI2C_Master_Interrupt_Master_Busy)!=0)
			{
				Err=Error_Busy;
				goto Exit_I2C_Transmit_Cmd;
			}

			//复位FIFO
			Error_NoArgs(Err,Drivers_S32K1xx_LPI2C_Master_Reset_FIFO((LPI2C_Type *)Device_Args,true,true))
			{
				goto Exit_I2C_Transmit_Cmd;
			}
			//初始化FIFO队列
			Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_Init(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO))
			{
				goto Exit_I2C_Transmit_Cmd;
			}
			Error_NoArgs(Err,Library_FIFO_1Byte_FIFO_Init(&Drivers_S32K1xx_I2C_DATA.I2C[Index].RX_FIFO))
			{
				goto Exit_I2C_Transmit_Cmd;
			}

			Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size=0;
			Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size=0;
			//准备数据
			uint16_t Temp_DATA;
			if(P_Transmit_Cmd->Slave_Address_10Bit==true)
			{
				//Slave_Address_1st
				Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Generate_START_And_Transmit_Address<<8)|(P_Transmit_Cmd->Slave_Address_1st<<1)|P_Transmit_Cmd->Read;
				Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
				{
					goto Exit_I2C_Transmit_Cmd;
				}
				Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

				//Slave_Address_2nd
				Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->Slave_Address_2nd;
				Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
				{
					goto Exit_I2C_Transmit_Cmd;
				}
				Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

				//DATA// 这个地方只能是发送数据 不能是接收数据 为什么 我是按照I2C协议来的。。。。。。
				for(int i=0;i<P_Transmit_Cmd->Size;i++)
				{
					Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->DATA[i];
					Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
					{
						goto Exit_I2C_Transmit_Cmd;
					}
					Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
				}

				//RepeatedSTART
				if(P_Transmit_Cmd->RepeatedSTART==true)
				{
					//Slave_Address_1st
					Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Generate_START_And_Transmit_Address<<8)|(P_Transmit_Cmd->Slave_Address_1st<<1)|P_Transmit_Cmd->RepeatedRead;
					Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
					{
						goto Exit_I2C_Transmit_Cmd;
					}
					Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

					if(P_Transmit_Cmd->RepeatedRead==true)
					{
						//RepeatedDATA
						for(int i=0;i<P_Transmit_Cmd->RepeatedSize;i++)
						{
							Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Receive_DATA_ACK<<8);
							Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
							{
								goto Exit_I2C_Transmit_Cmd;
							}
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size++;
						}
					}
					else
					{
						//Slave_Address_2nd
						Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->Slave_Address_2nd;
						Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
						{
							goto Exit_I2C_Transmit_Cmd;
						}
						Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

						//RepeatedDATA
						for(int i=0;i<P_Transmit_Cmd->RepeatedSize;i++)
						{
							Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->RepeatedDATA[i];
							Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
							{
								goto Exit_I2C_Transmit_Cmd;
							}
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
						}
					}
				}
			}
			else
			{
				//Slave_Address_1st
				Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Generate_START_And_Transmit_Address<<8)|(P_Transmit_Cmd->Slave_Address_1st<<1)|P_Transmit_Cmd->Read;
				Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
				{
					goto Exit_I2C_Transmit_Cmd;
				}
				Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

				if(P_Transmit_Cmd->Read==true)
				{
					//DATA
					for(int i=0;i<P_Transmit_Cmd->Size;i++)
					{
						Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Receive_DATA_ACK<<8);
						Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
						{
							goto Exit_I2C_Transmit_Cmd;
						}
						Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
						Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size++;
					}
				}
				else
				{
					//DATA
					for(int i=0;i<P_Transmit_Cmd->Size;i++)
					{
						Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->DATA[i];
						Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
						{
							goto Exit_I2C_Transmit_Cmd;
						}
						Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
					}
				}

				//RepeatedSTART
				if(P_Transmit_Cmd->RepeatedSTART==true)
				{
					//Slave_Address_1st
					Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Generate_START_And_Transmit_Address<<8)|(P_Transmit_Cmd->Slave_Address_1st<<1)|P_Transmit_Cmd->RepeatedRead;
					Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
					{
						goto Exit_I2C_Transmit_Cmd;
					}
					Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

					if(P_Transmit_Cmd->RepeatedRead==true)
					{
						//RepeatedDATA
						for(int i=0;i<P_Transmit_Cmd->RepeatedSize;i++)
						{
							Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Receive_DATA_ACK<<8);
							Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
							{
								goto Exit_I2C_Transmit_Cmd;
							}
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size++;
						}
					}
					else
					{
						//RepeatedDATA
						for(int i=0;i<P_Transmit_Cmd->RepeatedSize;i++)
						{
							Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Transmit_DATA<<8)|P_Transmit_Cmd->RepeatedDATA[i];
							Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
							{
								goto Exit_I2C_Transmit_Cmd;
							}
							Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;
						}
					}
				}
			}
			//STOP
			Temp_DATA=(Drivers_S32K1xx_LPI2C_Master_Command_Data_Generate_STOP_Condition<<8);
			Error_NoArgs(Err,Library_FIFO_2Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,Temp_DATA))
			{
				goto Exit_I2C_Transmit_Cmd;
			}
			Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size++;

			Drivers_S32K1xx_I2C_DATA.I2C[Index].Error=Drivers_S32K1xx_I2C_Error_OK;

			Error_NoArgs(Err,Drivers_S32K1xx_LPI2C_Master_SET_FIFO_Watermark((LPI2C_Type *)Device_Args,0,2))
			{
				goto Exit_I2C_Transmit_Cmd;
			}

			Error_NoArgs(Err,__Sys_Event_Flag_Clear(Drivers_S32K1xx_I2C_DATA.I2C[Index].Event_Flag))
			{
				goto Exit_I2C_Transmit_Cmd;
			}

			//打开发送数据中断
			Error_NoArgs(Err,Drivers_S32K1xx_LPI2C_Master_SET_Interrupt_Enabled(
					(LPI2C_Type *)Device_Args,
					Drivers_S32K1xx_LPI2C_Master_Interrupt_Transmit_Data|Drivers_S32K1xx_LPI2C_Master_Interrupt_Arbitration_Lost|Drivers_S32K1xx_LPI2C_Master_Interrupt_NACK_Detect|Drivers_S32K1xx_LPI2C_Master_Interrupt_STOP_Detect,
					Enable))
			{
				goto Exit_I2C_Transmit_Cmd;
			}
			//等待数据发送完成
			Error_NoArgs(Err,__Sys_Event_Flag_Wait(Drivers_S32K1xx_I2C_DATA.I2C[Index].Event_Flag,P_Transmit_Cmd->TimeOut))
			{
				goto Exit_I2C_Transmit_Cmd;
			}

			//
			if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Error==Drivers_S32K1xx_I2C_Error_OK)
			{

