leihen0525/Master.Drivers.S32K1xx/Drivers.S32K1xx.I2C/Drivers.S32K1xx.I2C.c
			}
			else if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Error==Drivers_S32K1xx_I2C_Error_Arbitration_Lost)
			{
				Err=Error_Busy;
				goto Exit_I2C_Transmit_Cmd;
			}
			else if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Error==Drivers_S32K1xx_I2C_Error_NACK)
			{
				Err=Error_Not_Responding;
				goto Exit_I2C_Transmit_Cmd;
			}
			else
			{
				Err=Error_Unknown;
				goto Exit_I2C_Transmit_Cmd;
			}

			//
			if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size!=0 || Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size!=0)
			{
				Err=Error_Unknown;
				goto Exit_I2C_Transmit_Cmd;
			}

			uint8_t Rx_DATA;
			if(P_Transmit_Cmd->Read==true)
			{

				int i=0;
				for(;i<P_Transmit_Cmd->Size;i++)
				{
					Err=Library_FIFO_1Byte_FIFO_OUT(&Drivers_S32K1xx_I2C_DATA.I2C[Index].RX_FIFO,&Rx_DATA);
					if(Err==Error_OK)
					{
						P_Transmit_Cmd->DATA[i]=Rx_DATA;
					}
					else if(Err==Error_Empty)
					{
						Err=Error_Unknown;
						goto Exit_I2C_Transmit_Cmd;
					}
					else
					{
						Err=Error_Unknown;
						goto Exit_I2C_Transmit_Cmd;
					}
				}
			}
			if(P_Transmit_Cmd->RepeatedRead==true)
			{
				int i=0;
				for(;i<P_Transmit_Cmd->RepeatedSize;i++)
				{
					Err=Library_FIFO_1Byte_FIFO_OUT(&Drivers_S32K1xx_I2C_DATA.I2C[Index].RX_FIFO,&Rx_DATA);
					if(Err==Error_OK)
					{
						P_Transmit_Cmd->RepeatedDATA[i]=Rx_DATA;
					}
					else if(Err==Error_Empty)
					{
						Err=Error_Unknown;
						goto Exit_I2C_Transmit_Cmd;
					}
					else
					{
						Err=Error_Unknown;
						goto Exit_I2C_Transmit_Cmd;
					}
				}
			}

			Err=Error_OK;

Exit_I2C_Transmit_Cmd:

			Error_NoArgs_Return(Temp_Err,__Sys_Semaphore_Release(Drivers_S32K1xx_I2C_DATA.I2C[Index].Semaphore,1,Null));

			return Err;
		}break;

		default:
		{
			return Error_Invalid_Parameter;
		}break;
	}
}
//---------------------------------------------------------------------------------------------------------
int Drivers_S32K1xx_I2C_GET_Count(void *Device_Args)
{
	switch ((uint32_t)Device_Args)
	{
		case LPI2C0_BASE:
		{
			return 0;
		}break;
#if (defined (__Target_S32K148__))
		case LPI2C1_BASE:
		{
			return 1;
		}break;
#endif
		default:
		{
			while(1);//绝对不能出现
		}break;
	}
}
//----------------------------------------------------------------------------------------------------

void Drivers_S32K1xx_I2C_Master_Slave_IRQ(void *Args,int IRQ_Index)
{
	/*
	int Err;
	LPI2C_Type *P_I2C=(LPI2C_Type *)Args;
	*/
	Drivers_S32K1xx_I2C_Master_IRQ(Args,IRQ_Index);
	Drivers_S32K1xx_I2C_Slave_IRQ(Args,IRQ_Index);

}
void Drivers_S32K1xx_I2C_Master_IRQ(void *Args,int IRQ_Index)
{
	int Err;
	LPI2C_Type *P_I2C=(LPI2C_Type *)Args;

	Drivers_S32K1xx_I2C_Error_Type I2C_Error=Drivers_S32K1xx_I2C_Error_OK;

	if(P_I2C==Null)return ;
	int Index=Drivers_S32K1xx_I2C_GET_Count(P_I2C);
	int Flag=Drivers_S32K1xx_LPI2C_Master_GET_Interrupt_Flag(P_I2C);
	int Flag_Clear=0;
	if(Flag<Error_OK)
	{
		return ;
	}

	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Data_Match)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_Data_Match;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Pin_Low_Timeout)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_Pin_Low_Timeout;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_FIFO_Error)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_FIFO_Error;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Arbitration_Lost)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_Arbitration_Lost;

		I2C_Error=Drivers_S32K1xx_I2C_Error_Arbitration_Lost;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_NACK_Detect)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_NACK_Detect;

		I2C_Error=Drivers_S32K1xx_I2C_Error_NACK;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_STOP_Detect)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_STOP_Detect;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_End_Packet)!=0)
	{
		Flag_Clear=Flag_Clear|Drivers_S32K1xx_LPI2C_Master_Interrupt_End_Packet;
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Receive_Data)!=0)
	{
		uint8_t Temp_Rx_DATA=0x00;
		bool RX_Empty;
		if(Drivers_S32K1xx_LPI2C_Master_GET_DATA(P_I2C,&RX_Empty,&Temp_Rx_DATA)==Error_OK)
		{
			if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size!=0)
			{
				if(Library_FIFO_1Byte_FIFO_IN(&Drivers_S32K1xx_I2C_DATA.I2C[Index].RX_FIFO,Temp_Rx_DATA)==Error_OK)
				{

				}

				Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size--;
			}
		}
	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Transmit_Data)!=0)
	{
		if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size!=0)
		{
			uint16_t Temp_Tx_DATA=0x00;
			Err=Library_FIFO_2Byte_FIFO_OUT(&Drivers_S32K1xx_I2C_DATA.I2C[Index].TX_FIFO,&Temp_Tx_DATA);
			if(Err==Error_OK)
			{

			}
			else if(Err==Error_Empty)
			{

			}
			else
			{

			}
			Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size--;

			if(Drivers_S32K1xx_LPI2C_Master_SET_DATA(P_I2C,(Drivers_S32K1xx_LPI2C_Master_Command_Data_Type)((Temp_Tx_DATA>>8)&0xFF),Temp_Tx_DATA&0xFF)==Error_OK)
			{

			}
			else
			{

			}

			if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size==0)
			{
				Drivers_S32K1xx_LPI2C_Master_SET_Interrupt_Enabled(P_I2C,Drivers_S32K1xx_LPI2C_Master_Interrupt_Transmit_Data,Disable);
			}

			Drivers_S32K1xx_LPI2C_Master_SET_Interrupt_Enabled(P_I2C,Drivers_S32K1xx_LPI2C_Master_Interrupt_Receive_Data,Enable);
		}


	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Bus_Busy)!=0)
	{

	}
	if((Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_Master_Busy)!=0)
	{

	}
	if(Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size==0)
	{
		Drivers_S32K1xx_LPI2C_Master_SET_Interrupt_Enabled(P_I2C,Drivers_S32K1xx_LPI2C_Master_Interrupt_Receive_Data,Disable);
	}

	Drivers_S32K1xx_LPI2C_Master_Clear_Interrupt_Flag(P_I2C,(Drivers_S32K1xx_LPI2C_Master_Interrupt_Type)Flag_Clear);

	if((Drivers_S32K1xx_I2C_DATA.I2C[Index].Rx_FIFO_Size==0 && Drivers_S32K1xx_I2C_DATA.I2C[Index].Tx_FIFO_Size==0 && (Flag&Drivers_S32K1xx_LPI2C_Master_Interrupt_STOP_Detect)!=0)
	|| I2C_Error==Drivers_S32K1xx_I2C_Error_Arbitration_Lost
	|| I2C_Error==Drivers_S32K1xx_I2C_Error_NACK)
	{
		Drivers_S32K1xx_I2C_DATA.I2C[Index].Error=I2C_Error;

		__Sys_Event_Flag_Set(Drivers_S32K1xx_I2C_DATA.I2C[Index].Event_Flag);
	}
}
void Drivers_S32K1xx_I2C_Slave_IRQ(void *Args,int IRQ_Index)
{
	int Err;
	LPI2C_Type *P_I2C=(LPI2C_Type *)Args;

}
__Sys_Device_Module_Init_Export(Drivers_S32K1xx_I2C_Setup);
